////////////////////////////////////////////////////////////////////////////////
//
// Процедура ЗагрузкаДанныхИзФайла(ПутьКФайлу, ПровайдерЗагрузки);
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ЗагрузкаДанныхИзФайла(ПутьКФайлу, ПровайдерЗагрузки) Экспорт
		
	Если ЗначениеЗаполнено(ПутьКФайлу)
		И ПроверитьФайлСуществует(ПутьКФайлу) Тогда
		
	КонецЕсли;
	
	// скопировать файл локально
	СтрПутьКФайлу = ПолучитьПутьДоФайла(ПутьКФайлу);
	
	
	
	
	Если ПровайдерЗагрузки = "ADO"  Тогда
		
	ИначеЕсли ПровайдерЗагрузки = "1c"  Тогда
		
	Иначе // Простой Excel	
		
	КонецЕсли;
	
	
    
КонецПроцедуры

Функция ПроверитьФайлСуществует(ПутьКФайлу)
	Возврат Истина;		
КонецФункции

Функция ПолучитьПутьДоФайла(ПутьКФайлу)
	
	Возврат ПутьКФайлу;
	
КонецФункции
