
//======================================================================================================================
// Обработчики формы

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Отказ = НЕ КонтрольПрав.ПравоДоступа_Просмотр(ЭтотОбъект);
КонецПроцедуры

Процедура ПриОткрытии()
	Инициализировать();	
КонецПроцедуры


Процедура Инициализировать()
	ПерваяСтрока = 1;
	ПутьКФайлу   = "";
	КонтрагентСнхронизации = "";
	
КонецПроцедуры	


//======================================================================================================================
// Обработчики кнопок на странице Профиль

Процедура ПутьКФайлуНачалоВыбора(Элемент, СтандартнаяОбработка)
	Режим=РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла=Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла= "";
	Фильтр="Excel(*.xl*)|*.xl*";
	ДиалогОткрытияФайла.Фильтр=Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор=Ложь;
	ДиалогОткрытияФайла.Заголовок="Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() тогда
		ПутьКФайлу=ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

Процедура ОсновныеДействияФормыПрофильПросмотр(Кнопка)
	
	// взять из настроек
	ПровайдерЗагрузки =  "ADO";
	
	ЗагрузкаДанныхИзФайла(ПутьКФайлу, ПровайдерЗагрузки);
	
КонецПроцедуры



//======================================================================================================================
// Обработчики кнопок на странице Доп Настройки



Процедура ОсновныеДействияФормыПрофильДалее(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры





//======================================================================================================================
// Обработчики кнопок на странице Обработка
