////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

// Процедура - обаботчик события, при нажатии на кнопку "ОК" Командной панели "ОсновныеДействияФормы"
//
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Закрыть(Истина);
	
КонецПроцедуры

НадписьТекстВыражения =
"В тексте выражения можно использовать следующие предопределенные параметры:
|   Результат      - результат вычисления (на входе - значение по умолчанию)
|   ТекстЯчейки    - текст текущей ячейки
|   ТекстыЯчеек    - массив текстов ячеек строки
|   ТекущиеДанные  - структура загруженных значений
|   Запрос         - Объект запрос с установленным Параметром 
|   ДанныеЯчейки = ТекстЯчейки";

//Единицы
//Результат = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(СокрЛП(ДанныеЯчейки));
//Если Результат = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка()  Тогда
//	Результат = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(СокрЛП(ДанныеЯчейки));
//	Если Результат = Справочники.ЕдиницыИзмерения.ПустаяСсылка()  Тогда
//		Если ЕдиницаИзмеренияПользователя=Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка() Тогда
//			Сообщить("Не создана номенклатура "+ СокрЛП(СтрокаПереноса.Номенклатура.Наименование)+" нет единицы измерения!");
//			Результат = Справочники.КлассификаторЕдиницИзмерения;
//		КонецЕсли;	
//	КонецЕсли;
//КонецЕсли;

//Запрос.Текст = "ВЫБРАТЬ
//	|	Номенклатура.Ссылка КАК Ссылка
//	|ИЗ
//	|	Справочник.Номенклатура КАК Номенклатура
//	|ГДЕ
//	|	Номенклатура.Производитель = &Производитель
//	|	И Номенклатура.АртикулПроизводителя = &ДанныеЯчейки";
//Запрос.УстановитьПараметр("Производитель", ТекущиеДанные.Производитель);
//ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
//Если ВыборкаЗапроса.Количество() > 1 Тогда
//	ТекущиеДанные.Ссылка = Справочники.Номенклатура.ПустаяСсылка();
//ИначеЕсли ВыборкаЗапроса.Следующий() Тогда
//	ТекущиеДанные.Ссылка = ВыборкаЗапроса.Ссылка;
//КонецЕсли;